{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задание 1\n",
    "```\n",
    "Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "documents = [\n",
    " {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    " {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    " {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]\n",
    "\n",
    "directories = {\n",
    " '1': ['2207 876234', '11-2'],\n",
    " '2': ['10006'],\n",
    " '3': []\n",
    "}\n",
    "\n",
    "def main():\n",
    "    while True:\n",
    "        user_input_1 = input('Введите команду: ')\n",
    "        if user_input_1 == 'p':\n",
    "            # узнать владельца по номеру документа \n",
    "            print_document_owner()\n",
    "        elif user_input_1 == 's':\n",
    "            # узнать полку по номеру документа\n",
    "            document_number = input('Введите номер документа: ')\n",
    "            directory = find_directory(document_number)\n",
    "            if directory is None:\n",
    "                print('Документ не найден в базе')\n",
    "            else:\n",
    "                print ('Документ хранится на полке: ', directory)\n",
    "        elif user_input_1 == 'l':\n",
    "            # узнать полную информацию по документам\n",
    "            show_all_documents()\n",
    "        elif user_input_1 == 'ads':\n",
    "            # добавить полку\n",
    "            directory = input('Введите номер полки: ')\n",
    "            was_directory_added = add_directory(directory)\n",
    "            all_directories = ', '.join(directories.keys())\n",
    "            if was_directory_added is True: \n",
    "                print(f'Полка добавлена. Текущий перечень полок: {all_directories}')\n",
    "            else:\n",
    "                print(f'Такая полка уже существует. Текущий перечень полок: {all_directories}')\n",
    "        elif user_input_1 == 'ds':\n",
    "            # удалить полку\n",
    "            directory = input('Введите номер полки: ')\n",
    "            delete_directory(directory)          \n",
    "        elif user_input_1 == 'q':\n",
    "            # прекратить работу\n",
    "            print('Конец работы')\n",
    "            break\n",
    "        else:\n",
    "            print('Неизвестная команда. Доступные команды: p, s, l, ads, ds, q')\n",
    "            \n",
    "def print_document_owner():\n",
    "    document_number = input('Введите номер документа: ')\n",
    "        \n",
    "    owner = None\n",
    "    for document in documents:\n",
    "        if document_number == document['number']:\n",
    "            owner = document['name']    \n",
    "            break\n",
    "    if owner is None:\n",
    "        print('Документ не найден в базе')\n",
    "    else:\n",
    "        print('Владелец документа: ', owner)\n",
    "    \n",
    "def find_directory(document_number):\n",
    "    \"\"\"Возвращает имя полки, если документ найден,\n",
    "    None, если не найден\"\"\"\n",
    "    found_directory = None\n",
    "    for directory, document_numbers in directories.items():\n",
    "        if document_number in document_numbers:\n",
    "            found_directory = directory\n",
    "            break\n",
    "    if found_directory is None:\n",
    "        return None\n",
    "    else:\n",
    "        return found_directory\n",
    "    \n",
    "def show_all_documents():\n",
    "    \"\"\"Печатает все сведения о всех документах, включая номер полки\"\"\"\n",
    "    for document in documents:\n",
    "        directory = find_directory(document['number'])\n",
    "        print(f\"№: {document['number']}, тип: {document['type']}, владелец: {document['name']}, полка хранения: {directory}\")       \n",
    "\n",
    "def add_directory(directory):\n",
    "    \"\"\"\n",
    "        Принимает номер полки, которую нужно добавить. \n",
    "        Возвращает True, если полка добавлена, False, если такая полка уже существует.\n",
    "    \"\"\"\n",
    "    if directory in directories:  \n",
    "        return False\n",
    "    else:\n",
    "        directories[directory] = []\n",
    "        return True\n",
    "\n",
    "def delete_directory(directory):\n",
    "    \"\"\"\n",
    "        Принимает номер полки, которую нужно удалить. \n",
    "        Выводит результат, не возвращает значения.\n",
    "    \"\"\"\n",
    "    if directory not in directories:\n",
    "        print(f'Такой полки не существует. Текущий перечень полок: {\", \".join(directories.keys())}')\n",
    "    else:\n",
    "        if len(directories[directory]) > 0:\n",
    "            print(f'На полке есть документы, удалите их перед удалением полки. Текущий перечень полок: {\", \".join(directories.keys())}')\n",
    "        else:\n",
    "            del(directories[directory])\n",
    "            print(f'Полка удалена. Текущий перечень полок: {\", \".join(directories.keys())}')\n",
    "main()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
